
{
    "name": "Juan Pablo Zuñiga Hidalgo",
    "projects": "Progetti",
    "cvheadings": {
        "abstract": "Abstract",
        "professionalexperience": "Esperienza Professionale",
        "formaleducation": "Educazione Formale",
        "coursesandcertifications": "Corsi e Certificazioni",
        "competenceoverview": "Panoramica delle Competenze",
        "skills": "Competenze",
        "personalinformation": "Informazioni Personali"
        },
    "website": "www.zunigajp.com",
    "github": "github.com/juanpablozunigahidalgo",
    "email": "juanpablo.zunigah@gmail.com",
    "phone": "+46729971641",
    "summary": "Ho conseguito una laurea magistrale in Ingegneria e una laurea magistrale in Economia e Gestione dell'Innovazione presso l'Università di Chalmers, con una passione per lo sviluppo continuo nell'analisi, nella digitalizzazione e nella programmazione. Con una solida base nell'organizzazione del lavoro e nella collaborazione efficace in team, eccello nel fornire comunicazioni chiare e concise. Il mio obiettivo professionale è contribuire come analista aziendale, programmatore, ingegnere per il miglioramento dei processi o designer, sfruttando la mia esperienza nell'intersezione tra ingegneria e business, in particolare nel campo dello sviluppo di soluzioni digitali e smart.",
    "competenceOverview": {
    "Programming": "2 anni",
    "Analytics": "2 anni",
    "Business": "5 anni",
    "Engineering": "3 anni",
    "Market Analyst": "1 anno"
    },
    "skills": [
    "Java",
    "Javascript",
    "Typescript",
    "HTML",
    "CSS",
    "SQL",
    "React",
    "Angular",
    "Python",
    "Visual Studio",
    "Git",
    "Github",
    "SpringIO",
    "MySQL",
    "MongoDB",
    "SAS",
    "Inventor",
    "MS Office",
    "SAP",
    "Power BI (DAX)",
    "Power Automate",
    "Power APP(s)"
    ],
    "formalEducation": [
    {
    "degree": "Laurea in Ingegneria Meccanica",
    "university": "Universidad Tecnica Federico Santa Maria",
    "startDate": {"year": 2005, "month": 9, "monthName": "settembre"},
    "endDate": {"year": 2009, "month": 6, "monthName": "giugno"},
    "duration": 45
    },
    {
    "degree": "Laurea Magistrale in Ingegneria Meccanica",
    "university": "Universidad Tecnica Federico Santa Maria",
    "startDate": {"year": 2009, "month": 9, "monthName": "settembre"},
    "endDate": {"year": 2011, "month": 6, "monthName": "giugno"},
    "duration": 21
    },
    {
    "degree": "Laurea Magistrale in Economia e Gestione dell'Innovazione",
    "university": "Università Tecnica di Chalmers",
    "startDate": {"year": 2013, "month": 9, "monthName": "settembre"},
    "endDate": {"year": 2015, "month": 6, "monthName": "giugno"},
    "duration": 21
    }
    ],
    "coursesAndCertifications": [
    {
    "course": "Sviluppo Web. Full Stack",
    "provider": "Code Academy",
    "startDate": {"year": 2018, "month": 9, "monthName": "settembre"},
    "endDate": {"year": 2019, "month": 6, "monthName": "giugno"},
    "duration": 9
    },
    {
    "course": "Power BI e Power Automate",
    "provider": "Microsoft",
    "startDate": {"year": 2018, "month": 9, "monthName": "settembre"},
    "endDate": {"year": 2019, "month": 6, "monthName": "giugno"},
    "duration": 9
    },
    {
    "course": "Sviluppo di Applicazioni Android",
    "provider": "Udemy",
    "startDate": {"year": 2020, "month": 1, "monthName": "gennaio"},
    "endDate": {"year": 2020, "month": 12, "monthName": "dicembre"},
    "duration": 12
    },
    {
    "course": "Nanodegree. Programmazione per Data Science, SQL e Python",
    "provider": "Udacity",
    "startDate": {"year": 2020, "month": 1, "monthName": "gennaio"},
    "endDate": {"year": 2020, "month": 12, "monthName": "dicembre"},
    "duration": 12
    },
    {
    "course": "Machine Learning Engineer con Azure Nanodegree",
    "provider": "Udacity",
    "startDate": {"year": 2021, "month": 1, "monthName": "gennaio"},
    "endDate": {"year": 2021, "month": 12, "monthName": "dicembre"},
    "duration": 12
    },
    {
    "course": "Bootcamp Java Full Stack, Angular",
    "provider": "CGI",
    "startDate": {"year": 2022, "month": 3, "monthName": "marzo"},
    "endDate": {"year": 2022, "month": 8, "monthName": "agosto"},
    "duration": 5
    },
    {
    "course": "Implementazione di Intelligenza Artificiale",
    "provider": "Università di Halmstad",
    "startDate": {"year": 2022, "month": 1, "monthName": "gennaio"},
    "endDate": {"year": 2022, "month": 12, "monthName": "dicembre"},
    "duration": 12
    },
    {
    "course": "Apprendimento Automatico",
    "provider": "Università di Halmstad",
    "startDate": {"year": 2023, "month": 1, "monthName": "gennaio"},
    "endDate": {"year": 2023, "month": 12, "monthName": "dicembre"},
    "duration": 12
    }
    ],
    "personalInformation": {
    "driverLicense": "B",
    "nationality": ["Svedese", "Cilena"],
    "languages": ["Spagnolo", "Inglese", "Svedese", "Italiano"]
    },
    "professionalExperience": [
    {
      "title": "Consulente IT. Programmazione e Design.",
      "company": "Upwork",
      "location": "Goteborg-Remoto",
      "startDate": {"year": 2024, "month": 3, "monthName": "Marzo"},
      "endDate": {"year": 2024, "month": 12, "monthName": "Dicembre"},
      "duration": 9,
      "description": "Ho fornito supporto allo sviluppo per due startup in fase iniziale. Nei settori sanitario e alimentare. Coprendo l'intero ciclo di vita del prodotto. Le responsabilità includevano la progettazione di prototipi in Figma, l'implementazione di soluzioni front-end e back-end utilizzando React con TypeScript. Ho integrato Firebase per la gestione dei dati in tempo reale e l'autenticazione degli utenti. Inoltre, l'implementazione di React Redux e API REST. Utilizzando fonti di dati esterne (API aperte). Anche, lo sviluppo di applicazioni web basate su OpenAI. Compreso uno strumento di diagnostica dei guasti delle macchine basato su IA per camion. Inoltre, lo sviluppo di soluzioni basate su mappe utilizzando dati di geolocalizzazione.",
      "tools": ["Figma", "GitHub Pages", "Servizi di Google Cloud", "Google Firebase", "Open AI", "Amadeus API", "React", "Node", "TypeScript", "Google Maps API", "Librerie MUI"]
    }, 
    {
    "title": "Fondatore in Residenza",
    "company": "Antler",
    "location": "Stoccolma",
    "startDate": {"year": 2023, "month": 8, "monthName": "agosto"},
    "endDate": {"year": 2023, "month": 11, "monthName": "novembre"},
    "duration": 3,
    "description": "Come partecipante al programma di innovazione per imprenditori Antler, ho avuto successo in un ambiente ad alta pressione focalizzato sullo sviluppo di venture aziendali innovative. Collaborando con imprenditori provenienti da diverse esperienze, eccelso nella formazione di team e nello sviluppo di idee all'avanguardia, incluse soluzioni digitali come app e siti web. Il mio ruolo si estendeva alla convalida dell'idoneità del mercato per prodotti/servizi attraverso proposte di affari convincenti presentate agli investitori di venture capital. In particolare, ho guidato la generazione di idee di sprint per settori che spaziavano dall'assicurazione alla costruzione e alla sanità.",
    "tools": ["Figma", "Flutter", "GitHub Pages", "Google Cloud", "Google Firebase", "Vertex AI", "Canva", "React", "Node", "TypeScript", "Google Maps API", "MUI Libraries", "Antler Education Literature"]
    },
    {
    "title": "Preparazione del Cohort",
    "company": "Antler",
    "location": "Goteborg-Remoto",
    "startDate": {"year": 2023, "month": 4, "monthName": "aprile"},
    "endDate": {"year": 2023, "month": 8, "monthName": "agosto"},
    "duration": 4,
    "description": "In preparazione al programma di incubazione Antler, ho intrapreso passi cruciali per migliorare www.tourismcycling.com migrandolo verso il framework React TypeScript. Ciò ha coinvolto l'uso delle librerie MUI per un'interfaccia utente/utente ottimizzata e il rilascio del sito su GitHub Pages. Inoltre, ho integrato le capacità di accesso di Auth0 e Google Site Analytics per un'autenticazione utente avanzata e un monitoraggio delle prestazioni. Completando questi sforzi,",
    "tools": [ "Google Cloud Education", "Amazon Education", "GitHub Pages", "React", "TypeScript", "Auth0", "Google Analytics", "Google Maps API", "MUI Libraries", "Antler Education Literature" ] 
    },
    {
    "title": "Sviluppatore Full Stack",
    "company": "Lynk&Co",
    "location": "Goteborg",
    "startDate": {"year": 2022, "month": 9, "monthName": "settembre"},
    "endDate": {"year": 2023, "month": 3, "monthName": "marzo"},
    "duration": 6,
    "description": "Come Sviluppatore Full Stack presso Lynk&Co, ho giocato un ruolo fondamentale nello sviluppo della nuova piattaforma di toolbox per la manutenzione per i tecnici di officina. Utilizzando il framework React TypeScript all'interno dell'ambiente Azure, ho collaborato strettamente con analisti aziendali e designer di esperienza utente per garantire una funzionalità senza soluzione di continuità. In particolare, ho implementato l'autenticazione Microsoft SSO, migliorando la sicurezza del sistema e l'accessibilità dell'utente. Inoltre, ho fornito supporto per la migrazione del sistema EC APP verso lo sviluppo Azure React TypeScript, integrando più API Cosmos Lynk&Co e implementando l'autenticazione Microsoft SSO.",
    "tools": [ "React", "Node", "JavaScript", "TypeScript", "HTML5", "CSS", "Azure", "Microsoft Authentication SSO", "Git", "Visual Studio", "Postman", "GitHub Autopilot", "Azure Portal", "Azure DevOps", "Azure Pipelines", "Azure Repository", "Azure Wiki Documentation", "Microsoft Office", "Miro", "Azure Server" ]
    },
    {
    "title": "Boot Camp Java",
    "company": "CGI",
    "location": "Goteborg",
    "startDate": {"year": 2022, "month": 3, "monthName": "marzo"},
    "endDate": {"year": 2022, "month": 8, "monthName": "agosto"},
    "duration": 5,
    "description": "Durante il mio periodo presso CGI, ho frequentato un intensivo Boot Camp Java focalizzato sullo sviluppo full-stack. Questo programma completo includeva la creazione di microservizi utilizzando Angular, il testing e il rilascio di applicazioni Single Page Applications front-end e back-end e lo sviluppo di API e microservizi RESTful. Abbracciando pratiche di codifica e disciplina ingegneristica del software, ho acquisito competenze nel lavorare all'interno di un ambiente CI/CD e nel rilasciare applicazioni in un ambiente cloud. In particolare, ho contribuito allo sviluppo di un portale di candidatura per lavoro completamente funzionale, dimostrando la mia abilità nelle tecnologie basate su Java e nello sviluppo web.",
    "tools": [ "Visual Studio", "Spring IO", "IntelliJ", "MS Office", "GitHub", "Angular", "MySQL", "MongoDB", "Docker", "Swagger", "Mockito", "Amazon Web Services", "Draw IO", "Java", "TypeScript", "HTML", "CSS", "SQL" ]
      },
    {
    "title": "Consulente di Programmazione-Analisi",
    "company": "Upwork",
    "location": "Goteborg-Remoto",
    "startDate": {"year": 2021, "month": 3, "monthName": "marzo"},
    "endDate": {"year": 2022, "month": 3, "monthName": "marzo"},
    "duration": 12,
    "description": "Come consulente su Upwork, mi sono specializzato nella programmazione BI e nell'analisi finanziaria, fornendo soluzioni personalizzate a clienti diversificati. Le mie responsabilità includevano la formulazione di proposte di lavoro, la definizione degli ambiti dei progetti e il monitoraggio continuo del lavoro per garantire la consegna tempestiva. In particolare, ho sviluppato dashboard analitici e programmi backend, definito architetture dati e condotto analisi finanziarie. Sfruttando strumenti come Power BI, Power Automate e GitHub Pages, ho fornito costantemente soluzioni orientate al valore allineate agli obiettivi del cliente.",
    "tools": ["Power BI", "Power Automate", "GitHub Pages", "Visual Studio", "MS Office", "Stack Overflow"]
      },
    {
    "title": "Produttore Creativo",
    "company": "Tourism Cycling",
    "location": "Goteborg",
    "startDate": {"year": 2020, "month": 9, "monthName": "settembre"},
    "endDate": {"year": 2021, "month": 2, "monthName": "febbraio"},
    "duration": 5,
    "description": "Ho creato un progetto open-source mirato ad assistere i ciclisti turistici di tutto il mondo. Sfruttando la mia competenza nella codifica, ho sviluppato www.tourismcycling.com, una piattaforma innovativa che genera automaticamente percorsi ciclabili stimando costi e tempo richiesto. Utilizzando tecnologie come Atom, GitHub e Amazon Web Services, ho garantito funzionalità e accessibilità senza soluzione di continuità per gli utenti. Inoltre, ho facilitato raccomandazioni di attrezzature basate sulla durata del viaggio, le condizioni meteorologiche e le opzioni di campeggio, migliorando l'esperienza complessiva dell'utente. In particolare, ho favorito un ambiente collaborativo rendendo il progetto disponibile per contributi su GitHub, estendendone ulteriormente l'impatto e la portata.",
    "tools": ["Atom", "GitHub", "GitHub Pages", "Facebook", "Instagram", "Amazon", "Google Domains","HTML", "CSS", "JavaScript", "Java"]
      },
    {
    "title": "Responsabile Progetti Finanziari",
    "company": "Volvo Trucks Technology",
    "location": "Goteborg",
    "startDate": {"year": 2017, "month": 1, "monthName": "gennaio"},
    "endDate": {"year": 2019, "month": 12, "monthName": "dicembre"},
    "duration": 36,
    "description": "Durante il mio incarico come Responsabile Progetti Finanziari presso Volvo Trucks Technology, ho svolto un ruolo fondamentale nella gestione degli aspetti finanziari dei progetti di ricerca e sviluppo. Responsabile della compilazione e analisi dei casi aziendali, ho garantito la previsione accurata dei costi del progetto che comprendevano varie commodity ingegneristiche e dipartimenti. Sfruttando strumenti di automazione come Flow, Power BI e Windows 365 all'interno del reparto finanziario, ho ottimizzato i processi e migliorato l'efficienza operativa. In particolare, il mio portfolio includeva progetti che spaziavano dalle soluzioni diagnostiche smart, alla sicurezza del software, alle innovazioni meccaniche e ai miglioramenti della manutenzione, evidenziando la mia versatilità e acume strategico.",
    "tools": ["SAP Logon Launcher", "SAP Business Analyzer", "MS Office", "MS Macro", "Profitability Evaluation Tool"]
      },
    {
    "title": "Intern-Progetto Finanziario",
    "company": "Volvo Trucks Technology",
    "location": "Goteborg",
    "startDate": {"year": 2016, "month": 4, "monthName": "aprile"},
    "endDate": {"year": 2016, "month": 10, "monthName": "ottobre"},
    "duration": 6,
    "description": "Nel mio ruolo di Intern-Progetto Finanziario, ho fornito un supporto cruciale nella gestione finanziaria, nell'analisi dei casi aziendali e nel controllo del budget per i progetti IT presso Volvo Trucks Technology. Ho guidato il potenziamento dei programmi educativi per i nuovi Responsabili Progetti Finanziari, consolidando strumenti e conoscenze essenziali necessari per una gestione efficace del progetto. Inoltre, ho sviluppato programmi basati su macro Excel per automatizzare compiti, facilitando il monitoraggio e la segnalazione del progetto. Completando questi sforzi, ho partecipato attivamente a vari corsi dell'Università Volvo, perfezionando ulteriormente le mie competenze ed expertise nei domini finanziario e della gestione dei progetti.",
    "tools": [ "SAP Logon Launcher", "SAP Business Analyzer", "MS Office", "MS Macro", "Profitability Evaluation Tool in Excel", "Visual Basic" ]
      },
    {
    "title": "Ricerca Globale di Mercato",
    "company": "SKF AB",
    "location": "Goteborg",
    "startDate": {"year": 2014, "month": 9, "monthName": "settembre"},
    "endDate": {"year": 2015, "month": 1, "monthName": "gennaio"},
    "duration": 16,
    "description": "Nel contesto di una tesi magistrale presso SKF AB, ho guidato un'ampia iniziativa di ricerca di mercato globale focalizzata su guarnizioni industriali in diverse industrie e continenti. Utilizzando sofisticate tecniche di analisi di mercato, ho stimato la dimensione del mercato e definito opportunità di crescita per le guarnizioni industriali SKF. Sfruttando strumenti come MS Office ed Excel, ho sintetizzato le conoscenze provenienti da oltre 50 manager vendite e mercato in tutto il mondo, consentendo decisioni informate. I miei contributi sono stati cruciali nella definizione del panorama competitivo e nel posizionamento strategico delle guarnizioni industriali SKF sul mercato globale.",
    "tools": ["MS Office", "Excel"]
      },
    {
    "title": "Ingegnere Meccanico",
    "company": "Anglo American",
    "location": "Santiago",
    "startDate": {"year": 2012, "month": 1, "monthName": "gennaio"},
    "endDate": {"year": 2013, "month": 7, "monthName": "luglio"},
    "duration": 18,
    "description": "Come Ingegnere Meccanico presso Anglo American, ho giocato un ruolo fondamentale nella supervisione delle prestazioni di produzione di impianti di smaltimento di rifiuti industriali. Partendo dalla conceptualizzazione fino alla realizzazione, ho collaborato con team multidisciplinari per garantire la conformità normativa, la sicurezza e l'efficienza operativa. In particolare, ho identificato e implementato ottimizzazioni di processo e condotto analisi di affidabilità e manutenzione per ridurre al minimo il downtime. I miei sforzi hanno portato a un aumento del 10% della produzione complessiva e al miglioramento del 15% nell'affidabilità operativa dell'impianto.",
    "tools": [
        "MS Office",
        "Excel",
        "SAP Logistics and Maintenance Modules",
        "Caterpillar Maintenance Modules",
        "Festo Automation"
        ]
      },
    {
    "title": "Professore Assistente",
    "company": "Universidad Tecnica Federico Santa Maria",
    "sede": "Valparaiso",
    "startDate": {"anno": 2008, "mese": 6, "nomeMese": "giugno"},
    "endDate": {"anno": 2011, "mese": 6, "nomeMese": "giugno"},
    "duration": 36,
    "description": "Come Professore Assistente, ho contribuito all'eccellenza accademica di una delle principali università ingegneristiche in Cile e America Latina. In questo ruolo, ho facilitato esperienze di apprendimento in corsi come trasferimento di calore, termodinamica e fisica moderna, favorendo un ambiente favorevole alla crescita e allo sviluppo degli studenti. Sfruttando la mia esperienza in software ingegneristici come Matlab, Mathematica e Inventor, ho progettato classi di esercizi coinvolgenti, esami ed esperienze di laboratorio. Inoltre, ho svolto un ruolo vitale nello sviluppo del curriculum e nella valutazione degli studenti, garantendo la consegna di un'istruzione di qualità allineata agli standard dell'industria.",
    "tools": ["Matlab", "Mathematica", "Wolfram", "Inventor", "Phoenix Fluid", "MS Office", "Fortran"]
      },
    {
    "title": "Supporto Ingegneristico",
    "company": "Bechtel Corporation",
    "location": "Santiago",
    "startDate": {"anno": 2011, "mese": 1, "nomeMese": "gennaio"},
    "endDate": {"anno": 2011, "mese": 2, "nomeMese": "febbraio"},
    "duration": 1,
    "description": "Come parte del team di supporto ingegneristico presso la Bechtel Corporation, ho contribuito all'esecuzione di successo di progetti minerari ed energetici in America del Sud. Incaricato dello sviluppo di reti idrauliche per un importante progetto minerario chiamato 'Las Bambas' in Perù, ho collaborato strettamente con team multidisciplinari per garantire il raggiungimento degli obiettivi del progetto. Sfruttando strumenti come MS Office e Bechtel hydraulics, ho fornito un prezioso supporto nella documentazione del progetto e nell'analisi tecnica. Inoltre, la mia partecipazione alle iniziative educative dell'Università Bechtel mi ha dotato di competenze essenziali in gestione dei progetti e gestione delle persone, sottolineando il mio impegno per lo sviluppo professionale e l'eccellenza.",
    "tools": ["MS Office", "Bechtel Hydraulics", "Inventor Autodesk"]
      },
    {
    "title": "Supporto Ingegneristico",
    "company": "Codelco",
    "location": "Los Andes",
    "startDate": {"anno": 2008, "mese": 1, "nomeMese": "gennaio"},
    "endDate": {"anno": 2008, "mese": 2, "nomeMese": "febbraio"},
    "duration": 1,
    "description": "Durante il mio incarico come Ingegnere di Supporto presso Codelco, il principale produttore mondiale di rame, ho svolto un ruolo cruciale nel migliorare le procedure di manutenzione per grandi attrezzature industriali. Sfruttando modelli di affidabilità basati sulla regressione di Weibull e dati in tempo reale, ho migliorato l'affidabilità e le prestazioni delle attrezzature, contribuendo all'efficienza operativa. Le mie responsabilità comprendevano la documentazione del progetto, l'analisi dei dati e il supporto tecnico, sottolineando il mio impegno nel fornire risultati tangibili. Attraverso la mia competenza in strumenti come MS Office ed Excel, ho fornito preziose intuizioni e raccomandazioni per ottimizzare le pratiche di manutenzione, consolidando ulteriormente la posizione di Codelco come leader globale nell'industria mineraria.",
    "tools": ["MS Office", "Excel", "SAP"]
      }
]
}