{
    "name": "Juan Pablo Zuñiga Hidalgo",
    "projects": "Projekt",
    "cvheadings": {
      "abstract": "Sammanfattning",
      "professionalexperience": "Yrkeserfarenhet",
      "formaleducation": "Formell Utbildning",
      "coursesandcertifications": "Kurser och Certifieringar",
      "competenceoverview": "Kompetensöversikt",
      "skills": "Färdigheter",
      "personalinformation": "Personlig Information"
      },
    "website": "www.zunigajp.com",
    "github": "github.com/juanpablozunigahidalgo",
    "email": "juanpablo.zunigah@gmail.com",
    "phone": "+46729971641",
    "summary": "Jag har en masterexamen i ingenjörs- och företagsekonomi för innovation från Chalmers tekniska universitet, med en passion för kontinuerlig utveckling inom analys, digitalisering och programmering. Med en solid grund i att organisera arbete och effektivt teamarbete excellerar jag i att leverera tydlig och koncis kommunikation. Mitt yrkesmål är att bidra som affärsanalytiker, kodare, processförbättringsingenjör eller designer, med min expertis vid skärningspunkten mellan teknik och affärer, särskilt inom utveckling av digitala och smarta lösningar.",
    "competenceOverview": {
    "Programming": "2 år",
    "Analytics": "2 år",
    "Business": "5 år",
    "Engineering": "3 år",
    "Marknadsanalytiker": "1 år"
    },
    "skills": [
    "Java",
    "Javascript",
    "Typescript",
    "HTML",
    "CSS",
    "SQL",
    "React",
    "Angular",
    "Python",
    "Visual Studio",
    "Git",
    "Github",
    "SpringIO",
    "MySQL",
    "MongoDB",
    "SAS",
    "Inventor",
    "MS Office",
    "SAP",
    "Power BI (DAX)",
    "Power Automate",
    "Power APP(s)"
    ],
    "formalEducation": [
    {
    "degree": "Civilingenjörsexamen i maskinteknik",
    "university": "Universidad Tecnica Federico Santa Maria",
    "startDate": {"year": 2005, "month": 9, "monthName": "september"},
    "endDate": {"year": 2009, "month": 6, "monthName": "juni"},
    "duration": 45
    },
    {
    "degree": "Civilingenjörsexamen i maskinteknik",
    "university": "Universidad Tecnica Federico Santa Maria",
    "startDate": {"year": 2009, "month": 9, "monthName": "september"},
    "endDate": {"year": 2011, "month": 6, "monthName": "juni"},
    "duration": 21
    },
    {
    "degree": "Magisterexamen i Management och ekonomi för innovation",
    "university": "Chalmers tekniska universitet",
    "startDate": {"year": 2013, "month": 9, "monthName": "september"},
    "endDate": {"year": 2015, "month": 6, "monthName": "juni"},
    "duration": 21
    }
    ],
    "coursesAndCertifications": [
    {
    "course": "Webbutveckling. Full stack",
    "provider": "Code Academy",
    "startDate": {"year": 2018, "month": 9, "monthName": "september"},
    "endDate": {"year": 2019, "month": 6, "monthName": "juni"},
    "duration": 9
    },
    {
    "course": "Power BI och Power Automate",
    "provider": "Microsoft",
    "startDate": {"year": 2018, "month": 9, "monthName": "september"},
    "endDate": {"year": 2019, "month": 6, "monthName": "juni"},
    "duration": 9
    },
    {
    "course": "Android-apputveckling",
    "provider": "Udemy",
    "startDate": {"year": 2020, "month": 1, "monthName": "januari"},
    "endDate": {"year": 2020, "month": 12, "monthName": "december"},
    "duration": 12
    },
    {
    "course": "Nanodegree. Programmering för datavetenskap, SQL och Python",
    "provider": "Udacity",
    "startDate": {"year": 2020, "month": 1, "monthName": "januari"},
    "endDate": {"year": 2020, "month": 12, "monthName": "december"},
    "duration": 12
    },
    {
    "course": "Maskininlärningsingenjör med Azure Nanodegree",
    "provider": "Udacity",
    "startDate": {"year": 2021, "month": 1, "monthName": "januari"},
    "endDate": {"year": 2021, "month": 12, "monthName": "december"},
    "duration": 12
    },
    {
    "course": "Full Stack Java Bootcamp, Angular",
    "provider": "CGI",
    "startDate": {"year": 2022, "month": 3, "monthName": "mars"},
    "endDate": {"year": 2022, "month": 8, "monthName": "augusti"},
    "duration": 5
    },
    {
    "course": "AI-implementering",
    "provider": "Halmstad universitet",
    "startDate": {"year": 2022, "month": 1, "monthName": "januari"},
    "endDate": {"year": 2022, "month": 12, "monthName": "december"},
    "duration": 12
    },
    {
    "course": "Maskininlärning",
    "provider": "Halmstad universitet",
    "startDate": {"year": 2023, "month": 1, "monthName": "januari"},
    "endDate": {"year": 2023, "month": 12, "monthName": "december"},
    "duration": 12
    }
    ],
    "personalInformation": {
    "driverLicense": "B",
    "nationality": ["Svensk", "Chilensk"],
    "languages": ["Spanska", "Engelska", "Svenska", "Italienska"]
    },
    "professionalExperience": [
    {
    "title": "IT-konsult. Programmering och Design.",
    "company": "Upwork",
    "location": "Göteborg-Remote",
    "startDate": {"year": 2024, "month": 3, "monthName": "Mars"},
    "endDate": {"year": 2024, "month": 12, "monthName": "December"},
    "duration": 9,
    "description": "Tillhandahöll utvecklingsstöd för två nystartade företag i ett tidigt skede. Inom hälso- och livsmedelssektorn. Omfattar hela produktlivscykeln. Ansvar inkluderade design av Figma-prototyper, implementering av front-end och back-end lösningar med React och TypeScript. Integrerade Firebase för realtidsdatabas och användarautentisering. Dessutom implementering av React Redux och REST API:er. Med användning av externa datakällor (öppna API:er). Även utveckling av webbaserade applikationer med OpenAI. Inklusive ett AI-baserat verktyg för maskinfel diagnostik för lastbilar. Även utveckling av kartbaserade lösningar med hjälp av geolokaliseringsdata.",
    "tools": ["Figma", "GitHub Pages", "Google Cloud-tjänster", "Google Firebase", "Open AI", "Amadeus API", "React", "Node", "TypeScript", "Google Maps API", "MUI-bibliotek"]
    },
    {
    "title": "Grundare i Residence",
    "company": "Antler",
    "location": "Stockholm",
    "startDate": {"year": 2023, "month": 8, "monthName": "augusti"},
    "endDate": {"year": 2023, "month": 11, "monthName": "november"},
    "duration": 3,
    "description": "Som deltagare i Antler Entrepreneur Innovation Program trivdes jag i en högtrycksmiljö fokuserad på att driva innovativa affärsinitiativ. Genom att samarbeta med entreprenörer från olika bakgrunder excellerade jag i teambildning och utvecklingen av banbrytande idéer, inklusive digitala lösningar som appar och webbplatser. Min roll utökades till att validera marknadsanpassning för produkter/tjänster genom övertygande affärsförslag presenterade för riskkapitalinvesterare. Påtagligt ledde jag sprintidégenereringar för sektorer som sträckte sig från försäkringar, konstruktion till hälsovård.",
    "tools": ["Figma", "Flutter", "GitHub Pages", "Google Cloud", "Google Firebase", "Vertex AI", "Canva", "React", "Node", "TypeScript", "Google Maps API", "MUI Libraries", "Antler Education Literature"]
    },
    {
    "title": "Kohortförberedelse",
    "company": "Antler",
    "location": "Göteborg-Remote",
    "startDate": {"year": 2023, "month": 4, "monthName": "april"},
    "endDate": {"year": 2023, "month": 8, "monthName": "augusti"},
    "duration": 4,
    "description": "Inför Antler Incubator Program utförde jag avgörande steg för att förbättra www.tourismcycling.com genom att migrera den till React TypeScript-ramverket. Detta innebar att utnyttja MUI-bibliotek för optimerad UI/UX och distribuera webbplatsen på GitHub Pages. Dessutom integrerade jag Auth0-inloggning och Google Site Analytics för förbättrad användarautentisering och prestandaövervakning. Kompletterande dessa insatser,",
    "tools": [ "Google Cloud Education", "Amazon Education", "GitHub Pages", "React", "TypeScript", "Auth0", "Google Analytics", "Google Maps API", "MUI Libraries", "Antler Education Literature" ] 
    },
    {
    "title": "Full Stack-utvecklare",
    "company": "Lynk&Co",
    "location": "Göteborg",
    "startDate": {"year": 2022, "month": 9, "monthName": "september"},
    "endDate": {"year": 2023, "month": 3, "monthName": "mars"},
    "duration": 6,
    "description": "Som Full Stack-utvecklare på Lynk&Co spelade jag en avgörande roll i utvecklingen av det nya underhållsverktyget för verkstadstekniker. Genom att använda React TypeScript-ramverket inom Azure-miljön samarbetade jag nära med affärsanalytiker och användarupplevelsedesigners för att säkerställa sömlös funktionalitet. Påtagligt implementerade jag Microsoft SSO-autentisering, vilket förbättrade systemets säkerhet och användaråtkomlighet. Dessutom tillhandahöll jag support för EC APP-systemmigrationen till React TypeScript Azure-utveckling, integrerade flera Lynk&Co Cosmos API:er och implementerade Microsoft SSO-autentisering.",
    "tools": [ "React", "Node", "JavaScript", "TypeScript", "HTML5", "CSS", "Azure", "Microsoft Authentication SSO", "Git", "Visual Studio", "Postman", "GitHub Autopilot", "Azure Portal", "Azure DevOps", "Azure Pipelines", "Azure Repository", "Azure Wiki Documentation", "Microsoft Office", "Miro", "Azure Server" ]
      },
    {
    "title": "Java Boot Camp",
    "company": "CGI",
    "location": "Göteborg",
    "startDate": {"year": 2022, "month": 3, "monthName": "mars"},
    "endDate": {"year": 2022, "month": 8, "monthName": "augusti"},
    "duration": 5,
    "description": "Under min tid på CGI genomgick jag en intensiv Java Boot Camp med fokus på full-stack-utveckling. Denna omfattande utbildning innefattade att bygga mikrotjänster med Angular, testa och distribuera front-end- och back-end Single Page Applications och utveckla RESTful API:er och mikrotjänster. Genom att omfamna kodningspraxis och mjukvaruutvecklingsdisciplin förvärvade jag färdigheter inom att arbeta i en CI/CD-miljö och distribuera applikationer i en molnmiljö. Påtagligt bidrog jag till utvecklingen av en helt fungerande jobbansökningsportal, vilket visar min skicklighet inom Java-baserade teknologier och webbutveckling.",
    "tools": [ "Visual Studio", "Spring IO", "IntelliJ", "MS Office", "GitHub", "Angular", "MySQL", "MongoDB", "Docker", "Swagger", "Mockito", "Amazon Web Services", "Draw IO", "Java", "TypeScript", "HTML", "CSS", "SQL" ]
      },
    {
    "title": "Analytics-Programmeringskonsult",
    "company": "Upwork",
    "location": "Göteborg-Remote",
    "startDate": {"year": 2021, "month": 3, "monthName": "mars"},
    "endDate": {"year": 2022, "month": 3, "monthName": "mars"},
    "duration": 12,
    "description": "Som konsult på Upwork specialiserade jag mig på BI-programmering och finansiell analys och levererade skräddarsydda lösningar till olika klienter. Mina ansvarsområden omfattade att utforma arbetsförslag, definiera projektomfattningar och övervaka kontinuerlig arbetsövervakning för att säkerställa tidig leverans. Påtagligt utvecklade jag analytiska instrumentpaneler och bakgrundsprogram, definierade dataarkitektur och utförde finansiell analys. Genom att använda verktyg som Power BI, Power Automate och GitHub Pages levererade jag konsekvent värdefulla lösningar som var i linje med klientens mål.",
    "tools": ["Power BI", "Power Automate", "GitHub Pages", "Visual Studio", "MS Office", "Stack Overflow"]
      },
    {
    "title": "Kreativ producent",
    "company": "Tourism Cycling",
    "location": "Göteborg",
    "startDate": {"year": 2020, "month": 9, "monthName": "september"},
    "endDate": {"year": 2021, "month": 2, "monthName": "februari"},
    "duration": 5,
    "description": "Jag skapade ett öppen källkodsprojekt med syfte att hjälpa cykelturister över hela världen. Genom att utnyttja min expertis inom kodning utvecklade jag www.tourismcycling.com, en innovativ plattform som automatiskt genererar cykelrutter samtidigt som den beräknar kostnader och nödvändig tid. Genom att använda teknologier som Atom, GitHub och Amazon Web Services säkerställde jag sömlig funktionalitet och tillgänglighet för användare. Dessutom underlättade jag rekommendationer av utrustning baserat på resans längd, väderförhållanden och campingalternativ, vilket förbättrade den övergripande användarupplevelsen. Påtagligt främjade jag en samarbetsmiljö genom att göra projektet tillgängligt för bidrag på GitHub, vilket ytterligare utökade dess påverkan och räckvidd.",
    "tools": ["Atom", "GitHub", "GitHub Pages", "Facebook", "Instagram", "Amazon", "Google Domains","HTML", "CSS", "JavaScript", "Java"]
      },
    {
    "title": "Projektledare inom finans",
    "company": "Volvo Trucks Technology",
    "location": "Göteborg",
    "startDate": {"year": 2017, "month": 1, "monthName": "januari"},
    "endDate": {"year": 2019, "month": 12, "monthName": "december"},
    "duration": 36,
    "description": "Under min tid som projektledare inom finans på Volvo Trucks Technology spelade jag en avgörande roll i att hantera de finansiella aspekterna av forsknings- och utvecklingsprojekt. Ansvarig för att sammanställa och analysera affärsfall säkerställde jag en korrekt prognos av projektets kostnader som omfattar olika ingenjörsvaror och avdelningar. Genom att använda automatiseringsverktyg som Flow, Power BI och Windows 365 inom finansavdelningen strömlinjeformade jag processer och förbättrade operationell effektivitet. Påtagligt inkluderade min portfölj projekt som omfattade smarta diagnoslösningar, mjukvarusäkerhet, mekaniska innovationer och underhållsförbättringar, vilket framhäver min mångsidighet och strategiska skicklighet.",
    "tools": ["SAP Logon Launcher", "SAP Business Analyzer", "MS Office", "MS Macro", "Profitability Evaluation Tool"]
      },
    {
    "title": "Praktikant-Finansprojektledare",
    "company": "Volvo Trucks Technology",
    "location": "Göteborg",
    "startDate": {"year": 2016, "month": 4, "monthName": "april"},
    "endDate": {"year": 2016, "month": 10, "monthName": "oktober"},
    "duration": 6,
    "description": "I min roll som praktikant inom finansprojektledning på Volvo Trucks Technology tillhandahöll jag avgörande stöd inom finansiell förvaltning, affärsfallanalys och budgetkontroll för IT-projekt. Jag ledde förbättringen av utbildningsprogram för nya finansprojektledare, där jag sammanförde viktiga verktyg och kunskaper som krävs för effektiv projektledning. Dessutom utvecklade jag Excel-makrobaserade program för att automatisera uppgifter, vilket underlättade strömlinjeformad projektspårning och rapportering. Genom att aktivt delta i olika Volvo University-kurser förbättrade jag mina färdigheter och expertis inom finans och projektledning.",
    "tools": [ "SAP Logon Launcher", "SAP Business Analyzer", "MS Office", "MS Macro", "Profitability Evaluation Tool in Excel", "Visual Basic" ]
      },
    {
    "title": "Global marknadsundersökning",
    "company": "SKF AB",
    "location": "Göteborg",
    "startDate": {"year": 2014, "month": 9, "monthName": "september"},
    "endDate": {"year": 2015, "month": 1, "monthName": "januari"},
    "duration": 16,
    "description": "I kontexten för ett examensarbete på SKF AB ledde jag en omfattande global marknadsundersökningsinitiativ fokuserad på industriella tätningar över olika branscher och kontinenter. Genom att använda sofistikerade marknadsanalystekniker uppskattade jag marknadens storlek och definierade tillväxtmöjligheter för SKF industriella tätningar. Genom att använda verktyg som MS Office och Excel syntetiserade jag insikter från över 50 försäljnings- och marknadschefer världen över, vilket möjliggjorde informerat beslutsfattande. Mina bidrag var avgörande för att definiera den konkurrenskraftiga landskapet och den strategiska positioneringen av SKF industriella tätningar på den globala marknaden.",
    "tools": ["MS Office", "Excel"]
    },
    {
    "title": "Maskiningenjör",
    "company": "Anglo American",
    "location": "Santiago",
    "startDate": {"year": 2011, "month": 8, "monthName": "augusti"},
    "endDate": {"year": 2013, "month": 8, "monthName": "augusti"},
    "duration": 24,
    "description": "Under min tid som maskiningenjör på Anglo American ansvarade jag för att hantera underhålls- och reparationsscheman för produktionsutrustning inom gruvindustrin. Genom att använda Inventor 3D CAD och SAP ERP-system sammanställde jag utrustningsdokumentation och underhållsrapporter som användes för att planera förebyggande underhållsaktiviteter. Dessutom genomförde jag noggranna tekniska utvärderingar och utvärderade leverantörsförslag för att säkerställa effektiva underhållslösningar och minimala produktionsavbrott. Påtagligt optimerade jag resursanvändningen och minskade driftskostnaderna genom att effektivisera underhållsprocesser och förbättra reservdelslagren.",
    "tools": ["Matlab", "Mathematica", "Wolfram", "Inventor", "Phoenix Fluid", "MS Office", "Fortran"]
      },
      {
        "title": "Assisterande Professor",
        "company": "Tekniska Universitetet Federico Santa María",
        "location": "Valparaíso",
        "startDate": {"year": 2008, "month": 6, "monthName": "Juni"},
        "endDate": {"year": 2011, "month": 6, "monthName": "Juni"},
        "duration": 36,
        "description": "Som Assisterande Professor bidrog jag till den akademiska excellensen vid ett av de främsta ingenjörsuniversiteten i Chile och Latinamerika. I denna roll underlättade jag lärandeupplevelser i kurser som värmeöverföring, termodynamik och mekanisk fysik, vägledde grundutbildningsstudenter i tillämpningen av teorier och koncept på praktiska problem. Förutom att hålla föreläsningar utvecklade jag läromedel och utvärderingar för att säkerställa förståelse och behärskning av ämnen. Mitt fokus på tydlighet i presentationen och engagemang för studenters framgång resulterade i en utmärkt utvärdering och erkännande från både lärare och elever.",
        "tools": ["Matlab", "Mathematica", "Wolfram", "Inventor", "Phoenix Fluid", "MS Office", "Fortran"]
        },
    {
        "title": "Teknisk Support",
        "company": "Bechtel Corporation",
        "location": "Santiago",
        "startDate": {"year": 2011, "month": 1, "monthName": "januari"},
        "endDate": {"year": 2011, "month": 2, "monthName": "februari"},
        "duration": 1,
        "description": "Som en del av teknisk supportteamet på Bechtel Corporation bidrog jag till framgångsrik utförande av gruv- och energiprojekt i Sydamerika. Uppgift med att utveckla hydrauliska nätverk för ett framstående gruvprojekt som heter 'Las Bambas' i Peru, samarbetade jag nära med mångdisciplinära team för att säkerställa att projektmål uppnåddes. Genom att använda verktyg som MS Office och Bechtel hydraulics tillhandahöll jag värdefull support för projektredovisning och teknisk analys. Dessutom utrustade min deltagande i Bechtel Universitys utbildningsinitiativ mig med väsentliga färdigheter inom projektledning och personalledning, vilket understryker min engagemang för professionell utveckling och excellens.",
        "tools": ["MS Office", "Bechtel Hydraulics", "Inventor Autodesk"]
      },
      {
        "title": "Teknisk Support",
        "company": "Codelco",
        "location": "Los Andes",
        "startDate": {"year": 2008, "month": 1, "monthName": "januari"},
        "endDate": {"year": 2008, "month": 2, "monthName": "februari"},
        "duration": 1,
        "description": "Under min tid som teknisk supportingenjör på Codelco, världens ledande kopparproducent, spelade jag en avgörande roll för att förbättra underhållsprocedurer för stora industriella utrustningar. Genom att utnyttja tillförlitlighetsmodeller baserade på Weibull-regression och realtidsdata förbättrade jag utrustningens tillförlitlighet och prestanda, vilket bidrog till operationell effektivitet. Mina ansvarsområden omfattade projektredovisning, dataanalys och teknisk support, vilket understryker mitt engagemang för att leverera mätbara resultat. Genom min kompetens inom verktyg som MS Office och Excel tillhandahöll jag värdefulla insikter och rekommendationer för att optimera underhållspraxis, vilket ytterligare konsoliderade Codelcos position som en global ledare inom gruvindustrin.",
        "tools": ["MS Office", "Excel", "SAP"]
      }
    ]
    }